{
  "topic": "Hackfish Project: AI Power Media Processing",
  "children": [
    {
      "topic": "Problem Statement",
      "summary": "Manually listening to audio or video files, taking notes, and searching for key points is time-consuming and inefficient.",
      "children": [
        {
          "topic": "Time Consumption",
          "summary": "Listening to an entire recording just to find one important moment is a huge waste of time.",
          "children": []
        },
        {
          "topic": "Inefficiency",
          "summary": "Manually summarizing long discussions and skipping through videos randomly hoping to find key parts is frustrating.",
          "children": []
        }
      ]
    },
    {
      "topic": "Solution: AI Power Media Processing",
      "summary": "An AI-powered tool that makes audio and video files searchable, interactive, and insightful.",
      "children": [
        {
          "topic": "Key Features",
          "summary": "High-accuracy speech-to-text with background noise or multiple accents, sentiment analysis, name detection, key topic detection, and interactive features like keyword search and clickable timestamps.",
          "children": [
            {
              "topic": "Speech-to-Text",
              "summary": "High-accuracy transcription even with background noise or multiple accents.",
              "children": []
            },
            {
              "topic": "Sentiment Analysis",
              "summary": "Detects emotions in speech, useful for analyzing customer calls, debates, or interviews.",
              "children": []
            },
            {
              "topic": "Name Detection and Key Topic Detection",
              "summary": "Identifies names, places, and key topics in audio and video files.",
              "children": []
            },
            {
              "topic": "Interactive Features",
              "summary": "Keyword search, clickable timestamps, and a mind map feature for easy navigation of the conversation.",
              "children": [
                {
                  "topic": "Keyword Search",
                  "summary": "Jump to an important moment by searching for a keyword.",
                  "children": []
                },
                {
                  "topic": "Clickable Timestamps",
                  "summary": "Access specific moments in audio or video files with clickable timestamps.",
                  "children": []
                },
                {
                  "topic": "Mind Map Feature",
                  "summary": "Visualize the conversation with a mind map, making it easier to understand key topics and connectors.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "topic": "Tech Stack",
          "summary": "Using XJS, TypeScript, Node.js, express, OpenIS Whisper local model for transcription, VideoGS for sentiment analysis, and PostgreSQL with the possibility to scale to NeonDB.",
          "children": [
            {
              "topic": "Frontend",
              "summary": "Using XJS and TypeScript for a smooth user interface.",
              "children": []
            },
            {
              "topic": "Backend",
              "summary": "Using Node.js and express for handling the backend.",
              "children": []
            },
            {
              "topic": "Transcription",
              "summary": "Using OpenIS Whisper local model for transcription.",
              "children": []
            },
            {
              "topic": "Sentiment Analysis",
              "summary": "Using VideoGS for sentiment analysis.",
              "children": []
            },
            {
              "topic": "Database",
              "summary": "Using PostgreSQL with the possibility to scale to NeonDB for storing bookmarks and timestamps.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "topic": "Target Audience",
      "summary": "Anyone who deals with audio or video content, including corporations, students, legal teams, content creators, and support teams.",
      "children": [
        {
          "topic": "Corporations",
          "summary": "Extract key decisions from long meetings, automate transcription for research purposes.",
          "children": []
        },
        {
          "topic": "Students",
          "summary": "Summarize lectures, study smart with automatic transcripts.",
          "children": []
        },
        {
          "topic": "Legal Teams",
          "summary": "Generate automatic transcripts for key studies, analyze customer interactions.",
          "children": []
        },
        {
          "topic": "Content Creators",
          "summary": "Repurpose the best moments from audio and video files.",
          "children": []
        },
        {
          "topic": "Support Teams",
          "summary": "Analyze customer interactions for better service, summarize long conversations.",
          "children": []
        }
      ]
    }
  ]
}